vanvught/GD32F103RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
/**
 * @file dmx.cpp
 *
 */
/* Copyright (C) 2021 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <cstdint>
#include <cstring>
#include <algorithm>
#include <cassert>

#include "dmxmulti.h"
#include "dmxconst.h"
#include "dmx_internal.h"

#include "rdm.h"
#include "rdm_e120.h"

#include "gd32.h"
#include "gd32_uart.h"
#include "gd32/dmx_config.h"

#include "debug.h"

#ifndef NDEBUG		// Logic Analyzer
# define PE0_LOW()	gpio_bit_reset(GPIOE, GPIO_PIN_0)
# define PE0_HIGH()	gpio_bit_set(GPIOE, GPIO_PIN_0)
# define PE1_LOW()	gpio_bit_reset(GPIOE, GPIO_PIN_1)
# define PE1_HIGH()	gpio_bit_set(GPIOE, GPIO_PIN_1)
# define PD7_LOW()	gpio_bit_reset(GPIOD, GPIO_PIN_7)
# define PD7_HIGH()	gpio_bit_set(GPIOD, GPIO_PIN_7)
#else
# define PE0_LOW()
# define PE0_HIGH()
# define PE1_LOW()
# define PE1_HIGH()
# define PD7_LOW()
# define PD7_HIGH()
#endif

#ifndef ALIGNED
# define ALIGNED __attribute__ ((aligned (4)))
#endif

namespace dmxmulti {
enum class TxRxState {
	IDLE,
	PRE_BREAK,
	BREAK,
	MAB,
	DMXDATA,
	RDMDATA,
	CHECKSUMH,
	CHECKSUML,
	RDMDISCFE,
	RDMDISCEUID,
	RDMDISCECS,
	DMXINTER
};

enum class PortState {
	IDLE = 0, TX, RX
};

struct TxData {
	uint8_t data[dmx::buffer::SIZE];	// multiple of uint16_t
	uint16_t nLength;
};

struct RxRdmStatistics {
	uint16_t nIndex;
	uint16_t nChecksum;					// This must be uint16_t
	uint16_t nDiscIndex;
};

struct RxDmxPackets {
	uint32_t nPerSecond;
	uint32_t nCount;
	uint32_t nCountPrevious;
	uint32_t nTimerCounterPrevious;
};

struct RxData {
	uint8_t data[dmx::buffer::SIZE];	// multiple of uint16_t
	union {
		RxRdmStatistics Rdm;
		Statistics Dmx;
	};
	volatile TxRxState State;
};

struct DirGpio {
	uint32_t nPort;
	uint32_t nPin;
};
}  // namespace dmxmulti

using namespace dmxmulti;
using namespace dmx;

static constexpr DirGpio s_DirGpio[DMX_MAX_PORTS] = {
		{ config::DIR_PORT_0_GPIO_PORT, config::DIR_PORT_0_GPIO_PIN },
#if DMX_MAX_PORTS >= 2
		{ config::DIR_PORT_1_GPIO_PORT, config::DIR_PORT_1_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 3
		{ config::DIR_PORT_2_GPIO_PORT, config::DIR_PORT_2_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 4
		{ config::DIR_PORT_3_GPIO_PORT, config::DIR_PORT_3_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 5
		{ config::DIR_PORT_4_GPIO_PORT, config::DIR_PORT_4_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 6
		{ config::DIR_PORT_5_GPIO_PORT, config::DIR_PORT_5_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 7
		{ config::DIR_PORT_6_GPIO_PORT, config::DIR_PORT_6_GPIO_PIN },
#endif
#if DMX_MAX_PORTS == 8
		{ config::DIR_PORT_7_GPIO_PORT, config::DIR_PORT_7_GPIO_PIN },
#endif
};

static volatile PortState sv_PortState[dmxmulti::config::max::OUT] ALIGNED;

// DMX RX

static uint8_t s_RxDmxPrevious[dmxmulti::config::max::IN][dmx::buffer::SIZE] ALIGNED;
static volatile RxDmxPackets sv_nRxDmxPackets[dmxmulti::config::max::IN] ALIGNED;

// RDM RX

volatile uint16_t gv_RdmDataReceiveEnd;

// DMX RDM RX

static RxData s_RxBuffer[dmxmulti::config::max::IN] ALIGNED;

// DMX TX

static TxData s_TxBuffer[dmxmulti::config::max::OUT];

static uint32_t s_nDmxTransmitBreakTime { dmx::transmit::BREAK_TIME_MIN };
static uint32_t s_nDmxTransmitMabTime { dmx::transmit::MAB_TIME_MIN };		///< MAB_TIME_MAX = 1000000U;
static uint32_t s_nDmxTransmitPeriod { dmx::transmit::PERIOD_DEFAULT };
static uint16_t s_nUartsSending;

void gpio_config() {
#ifndef NDEBUG
	rcu_periph_clock_enable(RCU_GPIOE);
	gpio_init(GPIOE, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_0 | GPIO_PIN_1);

	rcu_periph_clock_enable(RCU_GPIOD);
	gpio_init(GPIOD, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);

	PE0_LOW();
	PE1_LOW();
	PD7_LOW();
#endif
}

void irq_handler_dmx_rdm_input(const uint32_t uart, const uint32_t nPortIndex) {
	__DMB();
	uint16_t nIndex;
	uint32_t nCounter;
	PE0_HIGH();

	if (RESET != (USART_REG_VAL(uart, USART_FLAG_FERR) & BIT(USART_BIT_POS(USART_FLAG_FERR)))) {
		USART_REG_VAL(uart, USART_FLAG_FERR) &= ~BIT(USART_BIT_POS(USART_FLAG_FERR));
		static_cast<void>(GET_BITS(USART_DATA(uart), 0U, 8U));
		s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket = 0;
		s_RxBuffer[nPortIndex].State = TxRxState::BREAK;
		PE0_LOW();
		PE1_LOW();
		PD7_LOW();
		return;
	}

	const auto data = static_cast<uint16_t>(GET_BITS(USART_DATA(uart), 0U, 8U));

	switch (s_RxBuffer[nPortIndex].State) {
	case TxRxState::IDLE:
		s_RxBuffer[nPortIndex].State = TxRxState::RDMDISCFE;
		s_RxBuffer[nPortIndex].data[0] = data;
		s_RxBuffer[nPortIndex].Rdm.nIndex = 1;
		break;
	case TxRxState::BREAK:
		switch (data) {
		case START_CODE:
			s_RxBuffer[nPortIndex].data[0] = START_CODE;
			s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket = 1;
			sv_nRxDmxPackets[nPortIndex].nCount++;
#if DMX_MAX_PORTS >= 5
			if (nPortIndex <= 3) {
#endif
				sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = TIMER_CNT(TIMER2);
#if DMX_MAX_PORTS >= 5
			}
			else {
				sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = TIMER_CNT(TIMER3);
			}
#endif

			s_RxBuffer[nPortIndex].State = TxRxState::DMXDATA;
			PE1_HIGH();
			break;
		case E120_SC_RDM:
			s_RxBuffer[nPortIndex].data[0] = E120_SC_RDM;
			s_RxBuffer[nPortIndex].Rdm.nChecksum = E120_SC_RDM;
			s_RxBuffer[nPortIndex].Rdm.nIndex = 1;

			s_RxBuffer[nPortIndex].State = TxRxState::RDMDATA;
			PE1_HIGH();
			break;
		default:
			s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
			break;
		}
		break;
	case TxRxState::DMXDATA:
		nIndex = s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket;
		s_RxBuffer[nPortIndex].data[nIndex] = data;
		s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket++;

